Ran Plan for dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # cloudflare_record.milanvit_net_cname["mail-sendgrid"] must be replaced
-/+ resource "cloudflare_record" "milanvit_net_cname" {
      ~ created_on  = "2020-07-17T01:05:32.618595Z" -> (known after apply)
      - data        = {} -> null
      ~ hostname    = "em3989.milanvit.net" -> (known after apply)
      ~ id          = "6e095b34a9e0d18b989aec8f9340c5e8" -> (known after apply)
      ~ metadata    = {
          - "auto_added"             = "false"
          - "managed_by_apps"        = "false"
          - "managed_by_argo_tunnel" = "false"
          - "source"                 = "primary"
        } -> (known after apply)
      ~ modified_on = "2020-07-17T01:05:32.618595Z" -> (known after apply)
      ~ name        = "em3989" -> "em5696" # forces replacement
      - priority    = 0 -> null
      ~ proxiable   = true -> (known after apply)
        proxied     = false
      ~ ttl         = 1 -> 3600
        type        = "CNAME"
        value       = "u17542702.wl203.sendgrid.net"
        zone_id     = "9f7f8ee361f355357f2463e64a170d0f"
    }

  # cloudflare_record.milanvit_net_cname["mail-sendgrid-domainkey-1"] will be updated in-place
~ resource "cloudflare_record" "milanvit_net_cname" {
        created_on  = "2020-07-17T01:05:36.921447Z"
        data        = {}
        hostname    = "s1._domainkey.milanvit.net"
        id          = "02f2a2e2a78fa19767aeb2f99cfdf28d"
        metadata    = {
            "auto_added"             = "false"
            "managed_by_apps"        = "false"
            "managed_by_argo_tunnel" = "false"
            "source"                 = "primary"
        }
        modified_on = "2020-07-17T01:05:36.921447Z"
        name        = "s1._domainkey"
        priority    = 0
        proxiable   = true
        proxied     = false
      ~ ttl         = 1 -> 3600
        type        = "CNAME"
        value       = "s1.domainkey.u17542702.wl203.sendgrid.net"
        zone_id     = "9f7f8ee361f355357f2463e64a170d0f"
    }

  # cloudflare_record.milanvit_net_cname["mail-sendgrid-domainkey-2"] will be updated in-place
~ resource "cloudflare_record" "milanvit_net_cname" {
        created_on  = "2020-07-17T01:05:35.447261Z"
        data        = {}
        hostname    = "s2._domainkey.milanvit.net"
        id          = "ce089fc782e3e689448ea8d7b2d528c2"
        metadata    = {
            "auto_added"             = "false"
            "managed_by_apps"        = "false"
            "managed_by_argo_tunnel" = "false"
            "source"                 = "primary"
        }
        modified_on = "2020-07-17T01:05:35.447261Z"
        name        = "s2._domainkey"
        priority    = 0
        proxiable   = true
        proxied     = false
      ~ ttl         = 1 -> 3600
        type        = "CNAME"
        value       = "s2.domainkey.u17542702.wl203.sendgrid.net"
        zone_id     = "9f7f8ee361f355357f2463e64a170d0f"
    }

Plan: 1 to add, 2 to change, 1 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d .`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.milanvit.net/lock?id=Cellane%252Fmilanvit.net%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d .`
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
